# <font color=blue|red|pink|yellow>Introduction to Pandas1</font>

## Pandas Vs NumPy

### Pandas
pandas has Serise object is more flixible as you <br>can define your own labeled index and access elements of an array.

### NumPy
Elements in numPy arrays are accessed by their defult integer position

### How to import pandas in Python 

import pandas as pd

In [2]:
import pandas as pd

### What kind of data does suit Pandas the  most?

- Tabular data
- Arbitrary Matrix
- Time Serise Data

### DataSet in Pandas
####  Series Object 
     One Dimensional labeled Array
     Contains data of similier or mixed types
     e.g data = [1,2,3,4,5]

In [3]:
import pandas as pd
data = [1,2,3,4,5]
series = pd.Series(data)
print(series)

#Check Type 
type(series)

0    1
1    2
2    3
3    4
4    5
dtype: int64

pandas.core.series.Series

#### How to change the index name?

In [4]:
# changing the indexing of series
series = pd.Series(data, index = ['a','b','c','d','e'])
series

a    1
b    2
c    3
d    4
e    5
dtype: int64

####  DataFrame
    Two Dimensional labeled data structures
    with columns of potentialydifferent types
    
##### Features of DataFrame
    . Different Columns types
    . Mutabe Size
    . Labeled axes
    . Automatic operations on rows and columns

#### How to create DataFrame?

In [5]:
import pandas  as pd
data = [1,2,3,4,5]
df = pd.DataFrame(data)
df

   0
0  1
1  2
2  3
3  4
4  5

#### Let's create a DataFrame using Dictionary

In [6]:
dictionary = {'fruts':['apple','mango','bananna'],'count':[10,20,30]}
df=pd.DataFrame(dictionary)
df

     fruts  count
0    apple     10
1    mango     20
2  bananna     30

#### Creating DataFrame usning Series

In [7]:
series = pd.Series([6,12],index = ['a','b'])
df = pd.DataFrame(series)
df

    0
a   6
b  12

#### Using NumPy and Pandas Create a DataFrame

In [12]:
import numpy as np
import pandas as pd
nparray= np.array([[5000,6000],['Zeeshan','Ali']])
df = pd.DataFrame({'name':nparray[1],'salary':nparray[0]})
df

      name salary
0  Zeeshan   5000
1      Ali   6000

#### How to perform Merge Operation?

In [16]:
import pandas as pd
import numpy as np

player = ['Player1','Player2','Player3']
point = [4,5,6]
title = ['Game1','Game2','Game3']
df1 = pd.DataFrame({'Player':player,'Points':point,'Title':title})
df1

    Player  Points  Title
0  Player1       4  Game1
1  Player2       5  Game2
2  Player3       6  Game3

In [18]:
player = ['Player4','Player5','Player6']
power = ['punch','kick','bomb']
title = ['Game1','Game4','Game5']

df2 = pd.DataFrame({'Player':player,'Power':power, 'Title':title})
df2

    Player  Power  Title
0  Player4  punch  Game1
1  Player5   kick  Game4
2  Player6   bomb  Game5

In [21]:
player = ['Player7','Player8','Player9']
powers = ['bomb','punch','kick']
title = ['Game6','Game7','Game8']

df3 = pd.DataFrame({'Player':player,'Power':power,'Title':title})
df3

    Player  Power  Title
0  Player7  punch  Game6
1  Player8   kick  Game7
2  Player9   bomb  Game8

In [29]:
# inner merge

df1.merge(df2, on='Title', how = 'inner')
#or
#df1.merge(df2)

  Player_x  Points  Title Player_y  Power
0  Player1       4  Game1  Player4  punch

In [35]:
# left Merge
df1.merge(df2, on='Player', how='left')

    Player  Points Title_x Power Title_y
0  Player1       4   Game1   NaN     NaN
1  Player2       5   Game2   NaN     NaN
2  Player3       6   Game3   NaN     NaN

In [36]:
# right Merge
df1.merge(df2, on='Player', how='right')

    Player  Points Title_x  Power Title_y
0  Player4     NaN     NaN  punch   Game1
1  Player5     NaN     NaN   kick   Game4
2  Player6     NaN     NaN   bomb   Game5

In [37]:
# Outer Merge
df1.merge(df2, on='Player', how='outer')

    Player  Points Title_x  Power Title_y
0  Player1     4.0   Game1    NaN     NaN
1  Player2     5.0   Game2    NaN     NaN
2  Player3     6.0   Game3    NaN     NaN
3  Player4     NaN     NaN  punch   Game1
4  Player5     NaN     NaN   kick   Game4
5  Player6     NaN     NaN   bomb   Game5

# How to perform join operation using pandas

In [73]:
player = ['Player7','Player8','Player9']
powers = ['bomb','punch','kick']
title = ['Game6','Game7','Game8']

df4 = pd.DataFrame({'Player':player,'Power':power,'Title':title}, index = ['l1','l2','l3'])
df4

     Player  Power  Title
l1  Player7  punch  Game6
l2  Player8   kick  Game7
l3  Player9   bomb  Game8

In [74]:
player = ['Player7','Player8','Player9']
powers = ['bomb','punch','kick']
title = ['Game6','Game7','Game8']

df5 = pd.DataFrame({'Players':player,'Powers':power,'Titles':title}, index = ['l4','l5','l6'])
df5

    Players Powers Titles
l4  Player7  punch  Game6
l5  Player8   kick  Game7
l6  Player9   bomb  Game8

In [75]:
df4.join(df5, how = 'inner')

Empty DataFrame
Columns: [Player, Power, Title, Players, Powers, Titles]
Index: []

In [76]:
df4.join(df5, how = 'left')

     Player  Power  Title Players Powers Titles
l1  Player7  punch  Game6     NaN    NaN    NaN
l2  Player8   kick  Game7     NaN    NaN    NaN
l3  Player9   bomb  Game8     NaN    NaN    NaN

In [77]:
df4.join(df5, how = 'right')

   Player Power Title  Players Powers Titles
l4    NaN   NaN   NaN  Player7  punch  Game6
l5    NaN   NaN   NaN  Player8   kick  Game7
l6    NaN   NaN   NaN  Player9   bomb  Game8

In [78]:
df4.join(df5, how = 'outer')

     Player  Power  Title  Players Powers Titles
l1  Player7  punch  Game6      NaN    NaN    NaN
l2  Player8   kick  Game7      NaN    NaN    NaN
l3  Player9   bomb  Game8      NaN    NaN    NaN
l4      NaN    NaN    NaN  Player7  punch  Game6
l5      NaN    NaN    NaN  Player8   kick  Game7
l6      NaN    NaN    NaN  Player9   bomb  Game8

# How to concatinate two dfs using pandas

In [88]:

pd.concat([df4,df5])

C:\Users\zaliz\Anaconda3\lib\site-packages\ipykernel_launcher.py:1: FutureWarning: Sorting because non-concatenation axis is not aligned. A future version
of pandas will change to not sort by default.

To accept the future behavior, pass 'sort=False'.

To retain the current behavior and silence the warning, pass 'sort=True'.

  """Entry point for launching an IPython kernel.

     Player  Players  Power Powers  Title Titles
l1  Player7      NaN  punch    NaN  Game6    NaN
l2  Player8      NaN   kick    NaN  Game7    NaN
l3  Player9      NaN   bomb    NaN  Game8    NaN
l4      NaN  Player7    NaN  punch    NaN  Game6
l5      NaN  Player8    NaN   kick    NaN  Game7
l6      NaN  Player9    NaN   bomb    NaN  Game8

# Import & Analyzing DataSet Using Pandas

### Using COVID - 19 DataSet

In [144]:
import pandas as pd 
df = pd.read_csv('full_data.csv')
df.head()

         date     location  new_cases  new_deaths  total_cases  total_deaths
0  2020-02-25  Afghanistan        NaN         NaN            1           NaN
1  2020-02-26  Afghanistan        0.0         NaN            1           NaN
2  2020-02-27  Afghanistan        0.0         NaN            1           NaN
3  2020-02-28  Afghanistan        0.0         NaN            1           NaN
4  2020-02-29  Afghanistan        0.0         NaN            1           NaN

In [145]:
type(df)

pandas.core.frame.DataFrame

In [146]:
df.info(null_counts = True)

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 2867 entries, 0 to 2866
Data columns (total 6 columns):
date            2867 non-null object
location        2867 non-null object
new_cases       2707 non-null float64
new_deaths      540 non-null float64
total_cases     2867 non-null int64
total_deaths    587 non-null float64
dtypes: float64(3), int64(1), object(2)
memory usage: 134.5+ KB

In [147]:
df.describe()

          new_cases  new_deaths    total_cases  total_deaths
count   2707.000000  540.000000    2867.000000    587.000000
mean     131.927595   27.262963    2517.981863    404.933560
std      833.146654   78.823547   13805.255915   1020.459099
min      -10.000000    0.000000       1.000000      1.000000
25%        0.000000    0.000000       2.000000      1.000000
50%        0.000000    1.000000       9.000000      5.000000
75%        7.000000   15.000000      48.000000     60.500000
max    19572.000000  855.000000  179112.000000   7426.000000

In [148]:
df.count()

date            2867
location        2867
new_cases       2707
new_deaths       540
total_cases     2867
total_deaths     587
dtype: int64

In [149]:
#Correlation
df = df[['date','location','new_cases','new_deaths','total_cases','total_deaths']].corr()
df

              new_cases  new_deaths  total_cases  total_deaths
new_cases      1.000000    0.683554     0.623527      0.559036
new_deaths     0.683554    1.000000     0.658023      0.701836
total_cases    0.623527    0.658023     1.000000      0.985468
total_deaths   0.559036    0.701836     0.985468      1.000000

# Manipulating DataSet Indexing by position

In [161]:
df.iloc[2,:]

new_cases       0.623527
new_deaths      0.658023
total_cases     1.000000
total_deaths    0.985468
Name: total_cases, dtype: float64

In [164]:
#by location
df.loc[:,"new_cases"]

new_cases       1.000000
new_deaths      0.683554
total_cases     0.623527
total_deaths    0.559036
Name: new_cases, dtype: float64

In [166]:
#by location from new_cases t o total_cases
df.loc[:,"new_cases":"total_cases"]

              new_cases  new_deaths  total_cases
new_cases      1.000000    0.683554     0.623527
new_deaths     0.683554    1.000000     0.658023
total_cases    0.623527    0.658023     1.000000
total_deaths   0.559036    0.701836     0.985468

In [165]:
# df["location"] =1 -> it will set all col values to 1

#df.new_cases = df.new_cases.astype(float) -> this will change datatype

#cars.info(null_counts=True) -> see the change 

# df = df.drop(columans=["col name"]) -> for drop any column

# df.colname = df.colname.fillna(df.colname.mean()/meadian()/mode())-> fill null values

#df = df.rename(columns={'Unnamed:1':'any name'}) -> change or give the name to  the column